#include <Servo.h> //используем библиотеку для работы с сервоприводом

Servo servo; //объявляем переменную servo типа Servo

void setup() //процедура setup

{

servo.attach(5); //привязываем привод к порту 5

}

void loop() //процедура loop

{

servo.write(0); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(30); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(60); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(90); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(120); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(150); //ставим вал под 0

delay(2000); //ждем 2 секунды

servo.write(180); //ставим вал под 180

delay(2000); //ждем 2 секунды

}
